# VCC=3.290
# GND=0.0

# Rref1 = 1016
# Rref2 = 1005
# Rref3 = 1002

# # 第一行(OUT4)为低电平时采集的电压
# V4_IN1 = 3.086
# V4_IN2 = 2.461
# V4_IN3 = 2.192

# # 第二行(OUT3)为低电平时采集的电压
# V3_IN1 = 2.258
# V3_IN2 = 2.470
# V3_IN3 = 2.559

# # 第三行(OUT2)为低电平时采集的电压
# V2_IN1 = 2.262
# V2_IN2 = 2.470
# V2_IN3 = 2.558

# # 第四行(OUT1)为低电平时采集的电压
# V1_IN1 = 2.266
# V1_IN2 = 2.468
# V1_IN3 = 2.552

# R31 = ( VCC - V4_IN1 ) / ( VCC - V3_IN1 ) * Rref1
# R32 = ( VCC - V4_IN2 ) / ( VCC - V3_IN2 ) * Rref2
# R33 = ( VCC - V4_IN3 ) / ( VCC - V3_IN3 ) * Rref3

# R21 = ( VCC - V4_IN1 ) / ( VCC - V2_IN1 ) * Rref1
# R22 = ( VCC - V4_IN2 ) / ( VCC - V2_IN2 ) * Rref2
# R23 = ( VCC - V4_IN3 ) / ( VCC - V2_IN3 ) * Rref3

# R11 = ( VCC - V4_IN1 ) / ( VCC - V1_IN1 ) * Rref1
# R12 = ( VCC - V4_IN2 ) / ( VCC - V1_IN2 ) * Rref2
# R13 = ( VCC - V4_IN3 ) / ( VCC - V1_IN3 ) * Rref3

# print('R31 = ', R31, 'R32 = ', R32, 'R33 = ', R33)
# print('R21 = ', R21, 'R22 = ', R22, 'R23 = ', R23)
# print('R11 = ', R11, 'R12 = ', R12, 'R13 = ', R13)

# # R31 =  200.83720930232573 R32 =  1016.0304878048785 R33 =  1505.0560875512997
# # R21 =  201.61867704280175 R22 =  1016.0304878048785 R23 =  1502.9999999999993
# # R11 =  202.40625000000017 R12 =  1013.558394160584 R13 =  1490.7804878048778


VCC=3.290
GND=0.0

Rref1 = 1016
Rref2 = 1005
Rref3 = 1002

# 第一行(OUT4)为低电平时采集的电压
V4_IN1 = 3.014
V4_IN2 = 2.462
V4_IN3 = 2.198

# 第二行(OUT3)为低电平时采集的电压
V3_IN1 = 1.897
V3_IN2 = 2.470
V3_IN3 = 2.556

# 第三行(OUT2)为低电平时采集的电压
V2_IN1 = 1.905
V2_IN2 = 2.471
V2_IN3 = 2.558

# 第四行(OUT1)为低电平时采集的电压
V1_IN1 = 3.057
V1_IN2 = 2.470
V1_IN3 = 2.556

R31 = ( VCC - V4_IN1 ) / ( VCC - V3_IN1 ) * Rref1
R32 = ( VCC - V4_IN2 ) / ( VCC - V3_IN2 ) * Rref2
R33 = ( VCC - V4_IN3 ) / ( VCC - V3_IN3 ) * Rref3

R21 = ( VCC - V4_IN1 ) / ( VCC - V2_IN1 ) * Rref1
R22 = ( VCC - V4_IN2 ) / ( VCC - V2_IN2 ) * Rref2
R23 = ( VCC - V4_IN3 ) / ( VCC - V2_IN3 ) * Rref3

R11 = ( VCC - V4_IN1 ) / ( VCC - V1_IN1 ) * Rref1
R12 = ( VCC - V4_IN2 ) / ( VCC - V1_IN2 ) * Rref2
R13 = ( VCC - V4_IN3 ) / ( VCC - V1_IN3 ) * Rref3

print('R31 = ', R31, 'R32 = ', R32, 'R33 = ', R33)
print('R21 = ', R21, 'R22 = ', R22, 'R23 = ', R23)
print('R11 = ', R11, 'R12 = ', R12, 'R13 = ', R13)

# R31 =  201.30366116295784 R32 =  1014.8048780487806 R33 =  1490.713896457766
# R21 =  202.46642599277996 R22 =  1016.043956043956 R23 =  1494.7868852459012
# R11 =  1203.5021459227473 R12 =  1014.8048780487806 R13 =  1490.713896457766