# 第一次计算电阻值
# VCC=3.290
# GND=0.0

# Rref1 = 1016
# Rref2 = 1005
# Rref3 = 1002

# # 第一行(OUT4)为低电平时采集的电压
# V4_IN1 = 3.086
# V4_IN2 = 2.461
# V4_IN3 = 2.192

# # 第二行(OUT3)为低电平时采集的电压
# V3_IN1 = 2.258
# V3_IN2 = 2.470
# V3_IN3 = 2.559

# # 第三行(OUT2)为低电平时采集的电压
# V2_IN1 = 2.262
# V2_IN2 = 2.470
# V2_IN3 = 2.558

# # 第四行(OUT1)为低电平时采集的电压
# V1_IN1 = 2.266
# V1_IN2 = 2.468
# V1_IN3 = 2.552

# R31 = ( VCC - V4_IN1 ) / ( VCC - V3_IN1 ) * Rref1
# R32 = ( VCC - V4_IN2 ) / ( VCC - V3_IN2 ) * Rref2
# R33 = ( VCC - V4_IN3 ) / ( VCC - V3_IN3 ) * Rref3

# R21 = ( VCC - V4_IN1 ) / ( VCC - V2_IN1 ) * Rref1
# R22 = ( VCC - V4_IN2 ) / ( VCC - V2_IN2 ) * Rref2
# R23 = ( VCC - V4_IN3 ) / ( VCC - V2_IN3 ) * Rref3

# R11 = ( VCC - V4_IN1 ) / ( VCC - V1_IN1 ) * Rref1
# R12 = ( VCC - V4_IN2 ) / ( VCC - V1_IN2 ) * Rref2
# R13 = ( VCC - V4_IN3 ) / ( VCC - V1_IN3 ) * Rref3

# print('R31 = ', R31, 'R32 = ', R32, 'R33 = ', R33)
# print('R21 = ', R21, 'R22 = ', R22, 'R23 = ', R23)
# print('R11 = ', R11, 'R12 = ', R12, 'R13 = ', R13)

# # R31 =  200.83720930232573 R32 =  1016.0304878048785 R33 =  1505.0560875512997
# # R21 =  201.61867704280175 R22 =  1016.0304878048785 R23 =  1502.9999999999993
# # R11 =  202.40625000000017 R12 =  1013.558394160584 R13 =  1490.7804878048778



# # 改完R11后第二次计算电阻值
# VCC=3.290
# GND=0.0

# Rref1 = 1016
# Rref2 = 1005
# Rref3 = 1002

# # 第一行(OUT4)为低电平时采集的电压
# V4_IN1 = 3.014
# V4_IN2 = 2.462
# V4_IN3 = 2.198

# # 第二行(OUT3)为低电平时采集的电压
# V3_IN1 = 1.897
# V3_IN2 = 2.470
# V3_IN3 = 2.556

# # 第三行(OUT2)为低电平时采集的电压
# V2_IN1 = 1.905
# V2_IN2 = 2.471
# V2_IN3 = 2.558

# # 第四行(OUT1)为低电平时采集的电压
# V1_IN1 = 3.057
# V1_IN2 = 2.470
# V1_IN3 = 2.556

# R31 = ( VCC - V4_IN1 ) / ( VCC - V3_IN1 ) * Rref1
# R32 = ( VCC - V4_IN2 ) / ( VCC - V3_IN2 ) * Rref2
# R33 = ( VCC - V4_IN3 ) / ( VCC - V3_IN3 ) * Rref3

# R21 = ( VCC - V4_IN1 ) / ( VCC - V2_IN1 ) * Rref1
# R22 = ( VCC - V4_IN2 ) / ( VCC - V2_IN2 ) * Rref2
# R23 = ( VCC - V4_IN3 ) / ( VCC - V2_IN3 ) * Rref3

# R11 = ( VCC - V4_IN1 ) / ( VCC - V1_IN1 ) * Rref1
# R12 = ( VCC - V4_IN2 ) / ( VCC - V1_IN2 ) * Rref2
# R13 = ( VCC - V4_IN3 ) / ( VCC - V1_IN3 ) * Rref3

# print('R31 = ', R31, 'R32 = ', R32, 'R33 = ', R33)
# print('R21 = ', R21, 'R22 = ', R22, 'R23 = ', R23)
# print('R11 = ', R11, 'R12 = ', R12, 'R13 = ', R13)

# R31 =  201.30366116295784 R32 =  1014.8048780487806 R33 =  1490.713896457766
# R21 =  202.46642599277996 R22 =  1016.043956043956 R23 =  1494.7868852459012
# R11 =  1203.5021459227473 R12 =  1014.8048780487806 R13 =  1490.713896457766



# 电阻不变第三次计算电阻值，用单片机ADC采集，还是手动接VCC和GND
VCC=3.302
GND=0.0

Rref1 = 1016
Rref2 = 1005
Rref3 = 1002

# 第一行(OUT4)为低电平时采集的电压
V4_IN1 = 3.024
V4_IN2 = 2.471
V4_IN3 = 2.210
V4_IN1_AD =3683
V4_IN2_AD =2999
V4_IN3_AD =2675

# 第二行(OUT3)为低电平时采集的电压
V3_IN1 = 1.912
V3_IN2 = 2.481
V3_IN3 = 2.560
V3_IN1_AD =2308
V3_IN2_AD =3011
V3_IN3_AD =3118

# 第三行(OUT2)为低电平时采集的电压
V2_IN1 = 1.912
V2_IN2 = 2.477
V2_IN3 = 2.565
V2_IN1_AD =2297
V2_IN2_AD =3007
V2_IN3_AD =3119

# 第四行(OUT1)为低电平时采集的电压
V1_IN1 = 3.067
V1_IN2 = 2.478
V1_IN3 = 2.564
V1_IN1_AD =3738
V1_IN2_AD =3008
V1_IN3_AD =3114

R31 = ( VCC - V4_IN1 ) / ( VCC - V3_IN1 ) * Rref1
R32 = ( VCC - V4_IN2 ) / ( VCC - V3_IN2 ) * Rref2
R33 = ( VCC - V4_IN3 ) / ( VCC - V3_IN3 ) * Rref3

R21 = ( VCC - V4_IN1 ) / ( VCC - V2_IN1 ) * Rref1
R22 = ( VCC - V4_IN2 ) / ( VCC - V2_IN2 ) * Rref2
R23 = ( VCC - V4_IN3 ) / ( VCC - V2_IN3 ) * Rref3

R11 = ( VCC - V4_IN1 ) / ( VCC - V1_IN1 ) * Rref1
R12 = ( VCC - V4_IN2 ) / ( VCC - V1_IN2 ) * Rref2
R13 = ( VCC - V4_IN3 ) / ( VCC - V1_IN3 ) * Rref3

print('R31 = ', R31, 'R32 = ', R32, 'R33 = ', R33)
print('R21 = ', R21, 'R22 = ', R22, 'R23 = ', R23)
print('R11 = ', R11, 'R12 = ', R12, 'R13 = ', R13)

print('单片机AD采集')

R31_AD = ( 4096 - V4_IN1_AD ) / ( 4096 - V3_IN1_AD ) * Rref1
R32_AD = ( 4096 - V4_IN2_AD ) / ( 4096 - V3_IN2_AD ) * Rref2
R33_AD = ( 4096 - V4_IN3_AD ) / ( 4096 - V3_IN3_AD ) * Rref3

R21_AD = ( 4096 - V4_IN1_AD ) / ( 4096 - V2_IN1_AD ) * Rref1
R22_AD = ( 4096 - V4_IN2_AD ) / ( 4096 - V2_IN2_AD ) * Rref2
R23_AD = ( 4096 - V4_IN3_AD ) / ( 4096 - V2_IN3_AD ) * Rref3

R11_AD = ( 4096 - V4_IN1_AD ) / ( 4096 - V1_IN1_AD ) * Rref1
R12_AD = ( 4096 - V4_IN2_AD ) / ( 4096 - V1_IN2_AD ) * Rref2
R13_AD = ( 4096 - V4_IN3_AD ) / ( 4096 - V1_IN3_AD ) * Rref3
print('R31_AD = ', R31_AD, 'R32_AD = ', R32_AD, 'R33_AD = ', R33_AD)
print('R21_AD = ', R21_AD, 'R22_AD = ', R22_AD, 'R23_AD = ', R23_AD)
print('R11_AD = ', R11_AD, 'R12_AD = ', R12_AD, 'R13_AD = ', R13_AD)

# R31 =  203.20000000000002 R32 =  1017.2411693057244 R33 =  1474.6415094339625
# R21 =  203.20000000000002 R22 =  1012.3090909090907 R23 =  1484.6458616010855
# R11 =  1201.9063829787242 R12 =  1013.5376213592234 R13 =  1482.6341463414635
# 单片机AD采集
# R31_AD =  234.6800894854586 R32_AD =  1016.1152073732719 R33_AD =  1455.8711656441717
# R21_AD =  233.24513618677042 R22_AD =  1012.3829201101928 R23_AD =  1457.3613101330602
# R11_AD =  1172.0893854748604 R12_AD =  1013.3134191176471 R13_AD =  1449.9409368635438

# 单片机GPIO驱动 AD采集
# R31:262.027, R32:1010.492, R33:1423.789
# R21:263.964, R22:1013.260, R23:1422.356
# R11:1163.689, R12:1015.114, R13:1426.662